app/Controllers/Admin.php

    public function edit_kucing(){
    	if (!$this->isLoggedIn()) {
            $session = session();
            $session->setFlashdata('belumloginpesan', '<div class="alert alert-danger">
                          <button type="button" class="close" data-dismiss="alert" aria-hidden="true">&times;</button>
                          <i class="icon-line-lock"></i>Anda harus login terlebih dahulu untuk mengakses halaman pemesanan kendaraan.<br>Silahkan Coba Login.</a>
                        </div>');
            return redirect()->to("home/masuk");
        }

        $page = $this->request->getGet('id_kucing');

        $KucingModel = new KucingModel();
        $data['kucing'] = $KucingModel->where('id_kucing', $page)->findAll();
---
SELECT *
FROM `tbl_kucing`
WHERE `id_kucing` = '16'

    public function proses_edit_kucing()
    {
        $idt = $this->request->getPost('id_kucing');
        $nama_kucing = $this->request->getPost('kucing');
		$deskripsi = $this->request->getPost('deskripsi');

        // Retrieve the transaction from the database
        $KucingModel = new KucingModel();
        $kucing = $KucingModel->find($idt);

        if ($kucing) {
            // Update the status to "cancelled"
            $kucing->nama_kucing = $nama_kucing;
            $kucing->deskripsi = $deskripsi;

            // Save the updated transaction
            $KucingModel->save($kucing);
---
SELECT *
FROM `tbl_kucing`
WHERE `tbl_kucing`.`id_kucing` = '14'
UPDATE `tbl_kucing` SET `nama_kucing` = 'Kucing Singapura', `deskripsi` = 'Kucing pandai dan aktif asal Singapura ini adalah kucing keturunan berwarna cokelat tua di Asia Tenggara.', `foto` = 'demos/pet/images/services/14.jpg'
WHERE `tbl_kucing`.`id_kucing` IN ('14')

    public function kucing(){

		if (!$this->isLoggedIn()) {
            $session = session();
            $session->setFlashdata('belumloginpesan', '<div class="alert alert-danger">
                          <button type="button" class="close" data-dismiss="alert" aria-hidden="true">&times;</button>
                          <i class="icon-line-lock"></i>Anda harus login terlebih dahulu untuk mengakses halaman pemesanan kendaraan.<br>Silahkan Coba Login.</a>
                        </div>');
            return redirect()->to("home/masuk");
        }

        $KucingModel = new KucingModel();
        $data['kucing'] = $KucingModel->findAll();
---
SELECT *
FROM `tbl_kucing`