app/Controllers/Home.php

SELECT *
FROM `tbl_makanan`
SELECT *
FROM `tbl_kucing`
---
    public function index()
    {
        $MakananModel = new MakananModel();
        $data['makanan'] = $MakananModel->findAll();

        $KucingModel = new KucingModel();
        $data['kucing'] = $KucingModel->findAll();